app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins"
---
  def index
    @pins = Pin.all

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @pin = Pin.find(params[:id])